src/main/resources/example.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:car="http://cardlibrary2.webservices.integration.css.aamsystems.com">
    <soapenv:Header/>
    <soapenv:Body>
        <car:getMessageData>
            <car:aSession>4f652978c0a801d2623dcf2a20f244f2</car:aSession>
            <car:aCount>10</car:aCount>
        </car:getMessageData>
    </soapenv:Body>
</soapenv:Envelope>